In [1]:
%matplotlib inline
import pandas as pd

In [5]:
from IPython.core.display import HTML

In [21]:
titles = pd.read_csv('titles.csv')
cast = pd.read_csv('cast.csv')
release_dates = pd.read_csv('release_dates.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [9]:
titles.tail(10)

                                      title  year
244904                               Satori  2015
244905                            Siegfried  2005
244906          Como el perro del hortelano  1920
244907                            Fatal Sky  1990
244908         La bataille de San Sebastian  1968
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

In [22]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [23]:
release_dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### How many movies are listed in the titles dataframe?

In [20]:
titles.count()

title    244914
year     244914
dtype: int64

### What are the earliest two films listed in the titles dataframe?

In [32]:
a = titles.sort_values('year')

In [33]:
print(a[-2::])

                           title  year
183018  The Zero Century: Maetel  2026
242196                 100 Years  2115

### How many movies have the title "Hamlet"?

In [79]:
a = titles.loc[titles['title'] == 'Hamlet']
print(len(a))

20

### How many movies are titled "North by Northwest"?

In [76]:
a = titles.loc[titles['title'] == 'North by Northwest']
print(len(a))

1

### When was the first movie titled "Hamlet" made?

In [64]:
a = titles.loc[titles['title'] == 'Hamlet']
b = a.sort_values('year')
print(b[0:1])

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [68]:
a = titles.loc[titles['title'] == 'Treasure Island']
a.sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [73]:
a = titles.loc[titles['year'] == 1950]
print(len(a))

1113

### How many movies were made in the year 1960?

In [80]:
a = titles.loc[titles['year'] == 1960]
print(len(a))

1549

### How many movies were made from 1950 through 1959?

In [88]:
len(titles[((titles['year'] >= 1950) & (titles['year'] < 1960))])

12934

### In what years has a movie titled "Batman" been released?

In [86]:
a = titles.loc[titles['title'] == 'Batman']
b = a['year']
list(b)

[1943, 1989]

### How many roles were there in the movie "Inception"?

In [99]:
a = cast.loc[cast['title'] == 'Inception']
b = a['character']
b

98153              LAX Passenger
149008     Fischer's Jet Captain
183937                  Browning
197877          Mombasan Gambler
260128            Bridge Sub Con
                   ...
3387147                  Ariadne
3444628            Lobby Sub Con
3473041            Private Nurse
3480170                   Blonde
3731263                  Old Mal
Name: character, Length: 78, dtype: object

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were available for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?